contiki-os/contiki/cc26xxware/inc/hw_gpt.h
// Field: [10]    TAMRSU
//
// Timer A Match Register Update mode
//
// If the timer is disabled (CTL.TAEN = 0) when this bit is set, TAMATCHR
// and TAPR are updated when the timer is enabled. If the timer is stalled
// (CTL.TASTALL is set), TAMATCHR and TAPR are updated according to the
// configuration of this bit.
// ENUMs:
// CYCLEUPDATE          Update TAMATCHR and TAPR, if used, on the next
// cycle.
// TOUPDATE             Update TAMATCHR and TAPR, if used, on the next
// time-out.
//
#define GPT_TAMR_TAMRSU                                             0x00000400
#define GPT_TAMR_TAMRSU_BITN                                        10
#define GPT_TAMR_TAMRSU_M                                           0x00000400
#define GPT_TAMR_TAMRSU_S                                           10
#define GPT_TAMR_TAMRSU_CYCLEUPDATE                                 0x00000000
#define GPT_TAMR_TAMRSU_TOUPDATE                                    0x00000400

// Field: [9]    TAPWMIE
//
// GPT Timer A PWM Interrupt Enable This bit enables interrupts in PWM mode on
// rising, falling, or both edges of the CCP output.
// ENUMs:
// DIS                  Interrupt is disabled.
// EN                   Interrupt is enabled.  This bit is only valid in PWM
// mode.
//
#define GPT_TAMR_TAPWMIE                                            0x00000200
#define GPT_TAMR_TAPWMIE_BITN                                       9
#define GPT_TAMR_TAPWMIE_M                                          0x00000200
#define GPT_TAMR_TAPWMIE_S                                          9
#define GPT_TAMR_TAPWMIE_DIS                                        0x00000000
#define GPT_TAMR_TAPWMIE_EN                                         0x00000200

// Field: [8]    TAILD
//
// GPT Timer A PWM Interval Load Write
// ENUMs:
// CYCLEUPDATE          Update the TAR register with the value in the
// TAILR register on the next clock cycle. If the pre-scaler is used, update the
// TAPS register with the value in the TAPR register on the next clock
// cycle.
// TOUPDATE             Update the TAR register with the value in the
// TAILR register on the next timeout. If the prescaler is used, update the
// TAPS register with the value in the TAPR register on the next timeout.
//
#define GPT_TAMR_TAILD                                              0x00000100
#define GPT_TAMR_TAILD_BITN                                         8
#define GPT_TAMR_TAILD_M                                            0x00000100
#define GPT_TAMR_TAILD_S                                            8
#define GPT_TAMR_TAILD_CYCLEUPDATE                                  0x00000000
#define GPT_TAMR_TAILD_TOUPDATE                                     0x00000100

// Field: [7]    TASNAPS
//
// GPT Timer A Snap-Shot Mode
// ENUMs:
// DIS                  Snap-shot mode is disabled.
// EN                   If Timer A is configured in the periodic mode, the
// actual free-running value of Timer A is loaded at the time-out event into the GPT
// Timer A (TAR) register.
//
#define GPT_TAMR_TASNAPS                                            0x00000080
#define GPT_TAMR_TASNAPS_BITN                                       7
#define GPT_TAMR_TASNAPS_M                                          0x00000080
#define GPT_TAMR_TASNAPS_S                                          7
#define GPT_TAMR_TASNAPS_DIS                                        0x00000000
#define GPT_TAMR_TASNAPS_EN                                         0x00000080

// Field: [6]    TAWOT
//
// GPT Timer A Wait-On-Trigger
// ENUMs:
// NOWAIT               Timer A begins counting as soon as it is enabled.
// WAIT                 If Timer A is enabled (CTL.TAEN = 1), Timer A does not
// begin counting until it receives a trigger from the timer in the previous
// position in the daisy chain. This bit must be clear for GPT Module 0, Timer A
//
#define GPT_TAMR_TAWOT                                              0x00000040
#define GPT_TAMR_TAWOT_BITN                                         6
#define GPT_TAMR_TAWOT_M                                            0x00000040
#define GPT_TAMR_TAWOT_S                                            6
#define GPT_TAMR_TAWOT_NOWAIT                                       0x00000000
#define GPT_TAMR_TAWOT_WAIT                                         0x00000040

// Field: [5]    TAMIE
//
// GPT Timer A Match Interrupt Enable
// ENUMs:
// DIS                  The match interrupt is disabled.
// EN                   An interrupt is generated when the match value in
// TAMATCHR is reached in the one-shot and periodic modes.
//
#define GPT_TAMR_TAMIE                                              0x00000020
#define GPT_TAMR_TAMIE_BITN                                         5
#define GPT_TAMR_TAMIE_M                                            0x00000020
#define GPT_TAMR_TAMIE_S                                            5
#define GPT_TAMR_TAMIE_DIS                                          0x00000000
#define GPT_TAMR_TAMIE_EN                                           0x00000020

// Field: [4]    TACDIR
//
// GPT Timer A Count Direction
// ENUMs:
// DOWN                 The timer counts down.
// UP                   The timer counts up. When counting up, the timer starts
// from a value of 0x0.
//
#define GPT_TAMR_TACDIR                                             0x00000010
#define GPT_TAMR_TACDIR_BITN                                        4
#define GPT_TAMR_TACDIR_M                                           0x00000010
#define GPT_TAMR_TACDIR_S                                           4
#define GPT_TAMR_TACDIR_DOWN                                        0x00000000
#define GPT_TAMR_TACDIR_UP                                          0x00000010

// Field: [3]    TAAMS
//
// GPT Timer A Alternate Mode
//
// Note: To enable PWM mode, you must also clear TACM and then configure
// TAMR field to 0x2.
// ENUMs:
// CAP_COMP             Capture/Compare mode is enabled.
// PWM                  PWM mode is enabled
//
#define GPT_TAMR_TAAMS                                              0x00000008
#define GPT_TAMR_TAAMS_BITN                                         3
#define GPT_TAMR_TAAMS_M                                            0x00000008
#define GPT_TAMR_TAAMS_S                                            3
#define GPT_TAMR_TAAMS_CAP_COMP                                     0x00000000
#define GPT_TAMR_TAAMS_PWM                                          0x00000008

// Field: [2]    TACM
//
// GPT Timer A Capture Mode
// ENUMs:
// EDGCNT               Edge-Count mode
// EDGTIME              Edge-Time mode
//
#define GPT_TAMR_TACM                                               0x00000004
#define GPT_TAMR_TACM_BITN                                          2
#define GPT_TAMR_TACM_M                                             0x00000004
#define GPT_TAMR_TACM_S                                             2
#define GPT_TAMR_TACM_EDGCNT                                        0x00000000
#define GPT_TAMR_TACM_EDGTIME                                       0x00000004

