contiki-os/contiki/cc26xxware/inc/hw_gpt.h
// Field: [1:0] TAMR
//
// GPT Timer A Mode
//
// The Timer mode is based on the timer configuration defined by CFG
// ENUMs:
// ONE_SHOT             One-Shot Timer mode
// PERIODIC             Periodic Timer mode
// CAPTURE              Capture mode
//
#define GPT_TAMR_TAMR_M                                             0x00000003
#define GPT_TAMR_TAMR_S                                             0
#define GPT_TAMR_TAMR_ONE_SHOT                                      0x00000001
#define GPT_TAMR_TAMR_PERIODIC                                      0x00000002
#define GPT_TAMR_TAMR_CAPTURE                                       0x00000003

//*****************************************************************************
//
// Register: GPT_O_TBMR
//
//*****************************************************************************
// Field: [15:13] TCACT
//
// Timer Compare Action Select
// ENUMs:
// DIS_CMP              Disable compare operations
// TOG_ON_TO            Toggle State on Time-Out
// CLR_ON_TO            Clear CCP output pin on Time-Out
// SET_ON_TO            Set CCP output pin on Time-Out
// SETTOG_ON_TO         Set CCP output pin immediately and toggle on Time-Out
// CLRTOG_ON_TO         Clear CCP output pin immediately and toggle on Time-Out
// SETCLR_ON_TO         Set CCP output pin immediately and clear on Time-Out
// CLRSET_ON_TO         Clear CCP output pin immediately and set on Time-Out
//
#define GPT_TBMR_TCACT_M                                            0x0000E000
#define GPT_TBMR_TCACT_S                                            13
#define GPT_TBMR_TCACT_DIS_CMP                                      0x00000000
#define GPT_TBMR_TCACT_TOG_ON_TO                                    0x00002000
#define GPT_TBMR_TCACT_CLR_ON_TO                                    0x00004000
#define GPT_TBMR_TCACT_SET_ON_TO                                    0x00006000
#define GPT_TBMR_TCACT_SETTOG_ON_TO                                 0x00008000
#define GPT_TBMR_TCACT_CLRTOG_ON_TO                                 0x0000A000
#define GPT_TBMR_TCACT_SETCLR_ON_TO                                 0x0000C000
#define GPT_TBMR_TCACT_CLRSET_ON_TO                                 0x0000E000

// Field: [12]    TBCINTD
//
// One-Shot/Periodic Interrupt Mode
// ENUMs:
// EN_TO_INTR           Normal Time-Out Interrupt
// DIS_TO_INTR          Mask Time-Out Interrupt
//
#define GPT_TBMR_TBCINTD                                            0x00001000
#define GPT_TBMR_TBCINTD_BITN                                       12
#define GPT_TBMR_TBCINTD_M                                          0x00001000
#define GPT_TBMR_TBCINTD_S                                          12
#define GPT_TBMR_TBCINTD_EN_TO_INTR                                 0x00000000
#define GPT_TBMR_TBCINTD_DIS_TO_INTR                                0x00001000

// Field: [11]    TBPLO
//
// Legacy PWM operation
// ENUMs:
// LEGACY               Legacy operation
// CCP_ON_TO            CCP output pin is set to 1 on time-out
//
#define GPT_TBMR_TBPLO                                              0x00000800
#define GPT_TBMR_TBPLO_BITN                                         11
#define GPT_TBMR_TBPLO_M                                            0x00000800
#define GPT_TBMR_TBPLO_S                                            11
#define GPT_TBMR_TBPLO_LEGACY                                       0x00000000
#define GPT_TBMR_TBPLO_CCP_ON_TO                                    0x00000800

// Field: [10]    TBMRSU
//
// Timer B Match Register Update mode
//
// If the timer is disabled (CTL.TBEN is clear) when this bit is set,
// TBMATCHR and TBPR are updated when the timer is enabled. If the timer is
// stalled (CTL.TBSTALL is set), TBMATCHR and TBPR are updated according
// to the configuration of this bit.
// ENUMs:
// CYCLEUPDATE          Update TBMATCHR and TBPR, if used on the next
// cycle.
// TOUPDATE             Update the TBMATCHR and the TBPR, if used on the
// next time-out.
//
#define GPT_TBMR_TBMRSU                                             0x00000400
#define GPT_TBMR_TBMRSU_BITN                                        10
#define GPT_TBMR_TBMRSU_M                                           0x00000400
#define GPT_TBMR_TBMRSU_S                                           10
#define GPT_TBMR_TBMRSU_CYCLEUPDATE                                 0x00000000
#define GPT_TBMR_TBMRSU_TOUPDATE                                    0x00000400

// Field: [9]    TBPWMIE
//
// GPT Timer B PWM Interrupt Enable This bit enables interrupts in PWM mode on
// rising, falling, or both edges of the CCP output
// ENUMs:
// DIS                  Interrupt is disabled.
// EN                   Interrupt is enabled.  This bit is only valid in PWM
// mode.
//
#define GPT_TBMR_TBPWMIE                                            0x00000200
#define GPT_TBMR_TBPWMIE_BITN                                       9
#define GPT_TBMR_TBPWMIE_M                                          0x00000200
#define GPT_TBMR_TBPWMIE_S                                          9
#define GPT_TBMR_TBPWMIE_DIS                                        0x00000000
#define GPT_TBMR_TBPWMIE_EN                                         0x00000200

// Field: [8]    TBILD
//
// GPT Timer B PWM Interval Load Write
// ENUMs:
// CYCLEUPDATE          Update the TBR register with the value in the
// TBILR register on the next clock cycle. If the pre-scaler is used, update the
// TBPS register with the value in the TBPR register on the next clock
// cycle.
// TOUPDATE             Update the TBR register with the value in the
// TBILR register on the next timeout. If the prescaler is used, update the
// TBPS register with the value in the TBPR register on the next timeout.
//
#define GPT_TBMR_TBILD                                              0x00000100
#define GPT_TBMR_TBILD_BITN                                         8
#define GPT_TBMR_TBILD_M                                            0x00000100
#define GPT_TBMR_TBILD_S                                            8
#define GPT_TBMR_TBILD_CYCLEUPDATE                                  0x00000000
#define GPT_TBMR_TBILD_TOUPDATE                                     0x00000100

// Field: [7]    TBSNAPS
//
// GPT Timer B Snap-Shot Mode
// ENUMs:
// DIS                  Snap-shot mode is disabled.
// EN                   If Timer B is configured in the periodic mode
//
#define GPT_TBMR_TBSNAPS                                            0x00000080
#define GPT_TBMR_TBSNAPS_BITN                                       7
#define GPT_TBMR_TBSNAPS_M                                          0x00000080
#define GPT_TBMR_TBSNAPS_S                                          7
#define GPT_TBMR_TBSNAPS_DIS                                        0x00000000
#define GPT_TBMR_TBSNAPS_EN                                         0x00000080

// Field: [6]    TBWOT
//
// GPT Timer B Wait-On-Trigger
// ENUMs:
// NOWAIT               Timer B begins counting as soon as it is enabled.
// WAIT                 If Timer B is enabled (CTL.TBEN is set), Timer B does
// not begin counting until it receives a trigger from the timer in the previous
// position in the daisy chain.
//
#define GPT_TBMR_TBWOT                                              0x00000040
#define GPT_TBMR_TBWOT_BITN                                         6
#define GPT_TBMR_TBWOT_M                                            0x00000040
#define GPT_TBMR_TBWOT_S                                            6
#define GPT_TBMR_TBWOT_NOWAIT                                       0x00000000
#define GPT_TBMR_TBWOT_WAIT                                         0x00000040

// Field: [5]    TBMIE
//
// GPT Timer B Match Interrupt Enable.
// ENUMs:
// DIS                  The match interrupt is disabled.
// EN                   An interrupt is generated when the match value in the
// TBMATCHR register is reached in the one-shot and periodic modes.
//
#define GPT_TBMR_TBMIE                                              0x00000020
#define GPT_TBMR_TBMIE_BITN                                         5
#define GPT_TBMR_TBMIE_M                                            0x00000020
#define GPT_TBMR_TBMIE_S                                            5
#define GPT_TBMR_TBMIE_DIS                                          0x00000000
#define GPT_TBMR_TBMIE_EN                                           0x00000020

// Field: [4]    TBCDIR
//
// GPT Timer B Count Direction
// ENUMs:
// DOWN                 The timer counts down.
// UP                   The timer counts up. When counting up, the timer starts
// from a value of 0x0.
//
#define GPT_TBMR_TBCDIR                                             0x00000010
#define GPT_TBMR_TBCDIR_BITN                                        4
#define GPT_TBMR_TBCDIR_M                                           0x00000010
#define GPT_TBMR_TBCDIR_S                                           4
#define GPT_TBMR_TBCDIR_DOWN                                        0x00000000
#define GPT_TBMR_TBCDIR_UP                                          0x00000010

// Field: [3]    TBAMS
//
// GPT Timer B Alternate Mode
//
// Note: To enable PWM mode, you must also clear TBCM bit and configure TBMR
// field to 0x2.
// ENUMs:
// CAP_COMP             Capture/Compare mode is enabled.
// PWM                  PWM mode is enabled
//
#define GPT_TBMR_TBAMS                                              0x00000008
#define GPT_TBMR_TBAMS_BITN                                         3
#define GPT_TBMR_TBAMS_M                                            0x00000008
#define GPT_TBMR_TBAMS_S                                            3
#define GPT_TBMR_TBAMS_CAP_COMP                                     0x00000000
#define GPT_TBMR_TBAMS_PWM                                          0x00000008

