contiki-os/contiki/cc26xxware/inc/hw_gpt.h
// Field: [2]    TBCM
//
// GPT Timer B Capture Mode
// ENUMs:
// EDGCNT               Edge-Count mode
// EDGTIME              Edge-Time mode
//
#define GPT_TBMR_TBCM                                               0x00000004
#define GPT_TBMR_TBCM_BITN                                          2
#define GPT_TBMR_TBCM_M                                             0x00000004
#define GPT_TBMR_TBCM_S                                             2
#define GPT_TBMR_TBCM_EDGCNT                                        0x00000000
#define GPT_TBMR_TBCM_EDGTIME                                       0x00000004

// Field: [1:0] TBMR
//
// GPT Timer B Mode
//
// The Timer mode is based on the timer configuration defined by CFG.CFG
// ENUMs:
// ONE_SHOT             One-Shot Timer mode
// PERIODIC             Periodic Timer mode
// CAPTURE              Capture mode
//
#define GPT_TBMR_TBMR_M                                             0x00000003
#define GPT_TBMR_TBMR_S                                             0
#define GPT_TBMR_TBMR_ONE_SHOT                                      0x00000001
#define GPT_TBMR_TBMR_PERIODIC                                      0x00000002
#define GPT_TBMR_TBMR_CAPTURE                                       0x00000003

//*****************************************************************************
//
// Register: GPT_O_CTL
//
//*****************************************************************************
// Field: [14]    TBPWML
//
// GPT Timer B PWM Output Level
//
// 0: Output is unaffected.
// 1: Output is inverted.
// ENUMs:
// NORMAL               Not inverted
// INVERTED             Inverted
//
#define GPT_CTL_TBPWML                                              0x00004000
#define GPT_CTL_TBPWML_BITN                                         14
#define GPT_CTL_TBPWML_M                                            0x00004000
#define GPT_CTL_TBPWML_S                                            14
#define GPT_CTL_TBPWML_NORMAL                                       0x00000000
#define GPT_CTL_TBPWML_INVERTED                                     0x00004000

// Field: [13]    TBOTE
//
// GPT Timer B Output Trigger Enable
// ENUMs:
// DIS                  The output Timer B ADC trigger is disabled.
// EN                   The output Timer B ADC trigger is enabled.
//
#define GPT_CTL_TBOTE                                               0x00002000
#define GPT_CTL_TBOTE_BITN                                          13
#define GPT_CTL_TBOTE_M                                             0x00002000
#define GPT_CTL_TBOTE_S                                             13
#define GPT_CTL_TBOTE_DIS                                           0x00000000
#define GPT_CTL_TBOTE_EN                                            0x00002000

// Field: [11:10] TBEVENT
//
// GPT Timer B Event Mode
// ENUMs:
// POS                  Positive edge
// NEG                  Negative edge
// BOTH                 Both edges
//
#define GPT_CTL_TBEVENT_M                                           0x00000C00
#define GPT_CTL_TBEVENT_S                                           10
#define GPT_CTL_TBEVENT_POS                                         0x00000000
#define GPT_CTL_TBEVENT_NEG                                         0x00000400
#define GPT_CTL_TBEVENT_BOTH                                        0x00000C00

// Field: [9]    TBSTALL
//
// GPT Timer B Stall Enable
// ENUMs:
// DIS                  Timer B continues counting while the processor is halted
// by the debugger.
// EN                   Timer B freezes counting while the processor is halted
// by the debugger.
//
#define GPT_CTL_TBSTALL                                             0x00000200
#define GPT_CTL_TBSTALL_BITN                                        9
#define GPT_CTL_TBSTALL_M                                           0x00000200
#define GPT_CTL_TBSTALL_S                                           9
#define GPT_CTL_TBSTALL_DIS                                         0x00000000
#define GPT_CTL_TBSTALL_EN                                          0x00000200

// Field: [8]    TBEN
//
// GPT Timer B Enable
// ENUMs:
// DIS                  Timer B is disabled.
// EN                   Timer B is enabled and begins counting or the capture
// logic is enabled based on CFG register.
//
#define GPT_CTL_TBEN                                                0x00000100
#define GPT_CTL_TBEN_BITN                                           8
#define GPT_CTL_TBEN_M                                              0x00000100
#define GPT_CTL_TBEN_S                                              8
#define GPT_CTL_TBEN_DIS                                            0x00000000
#define GPT_CTL_TBEN_EN                                             0x00000100

// Field: [6]    TAPWML
//
// GPT Timer A PWM Output Level
// ENUMs:
// NORMAL               Not inverted
// INVERTED             Inverted
//
#define GPT_CTL_TAPWML                                              0x00000040
#define GPT_CTL_TAPWML_BITN                                         6
#define GPT_CTL_TAPWML_M                                            0x00000040
#define GPT_CTL_TAPWML_S                                            6
#define GPT_CTL_TAPWML_NORMAL                                       0x00000000
#define GPT_CTL_TAPWML_INVERTED                                     0x00000040

// Field: [5]    TAOTE
//
// GPT Timer A Output Trigger Enable
// ENUMs:
// DIS                  The output Timer A ADC trigger is disabled.
// EN                   The output Timer A ADC trigger is enabled.
//
#define GPT_CTL_TAOTE                                               0x00000020
#define GPT_CTL_TAOTE_BITN                                          5
#define GPT_CTL_TAOTE_M                                             0x00000020
#define GPT_CTL_TAOTE_S                                             5
#define GPT_CTL_TAOTE_DIS                                           0x00000000
#define GPT_CTL_TAOTE_EN                                            0x00000020

