contiki-os/contiki/cc26xxware/inc/hw_gpt.h
// Field: [2]    CAEIM
//
// Enabling this bit will make the RIS.CAERIS interrupt propagate to MIS.CAEMIS
// ENUMs:
// DIS                  Disable Interrupt
// EN                   Enable Interrupt
//
#define GPT_IMR_CAEIM                                               0x00000004
#define GPT_IMR_CAEIM_BITN                                          2
#define GPT_IMR_CAEIM_M                                             0x00000004
#define GPT_IMR_CAEIM_S                                             2
#define GPT_IMR_CAEIM_DIS                                           0x00000000
#define GPT_IMR_CAEIM_EN                                            0x00000004

// Field: [1]    CAMIM
//
// Enabling this bit will make the RIS.CAMRIS interrupt propagate to MIS.CAMMIS
// ENUMs:
// DIS                  Disable Interrupt
// EN                   Enable Interrupt
//
#define GPT_IMR_CAMIM                                               0x00000002
#define GPT_IMR_CAMIM_BITN                                          1
#define GPT_IMR_CAMIM_M                                             0x00000002
#define GPT_IMR_CAMIM_S                                             1
#define GPT_IMR_CAMIM_DIS                                           0x00000000
#define GPT_IMR_CAMIM_EN                                            0x00000002

// Field: [0]    TATOIM
//
// Enabling this bit will make the RIS.TATORIS interrupt propagate to
// MIS.TATOMIS
// ENUMs:
// DIS                  Disable Interrupt
// EN                   Enable Interrupt
//
#define GPT_IMR_TATOIM                                              0x00000001
#define GPT_IMR_TATOIM_BITN                                         0
#define GPT_IMR_TATOIM_M                                            0x00000001
#define GPT_IMR_TATOIM_S                                            0
#define GPT_IMR_TATOIM_DIS                                          0x00000000
#define GPT_IMR_TATOIM_EN                                           0x00000001

//*****************************************************************************
//
// Register: GPT_O_RIS
//
//*****************************************************************************
// Field: [16]    WURIS
//
// GPT Write Update Error Raw Interrupt
//
// 0: No error.
// 1: Either Timer A or B was written twice in a Row or Timer A was written
// before the corresponding Timer B was written.
#define GPT_RIS_WURIS                                               0x00010000
#define GPT_RIS_WURIS_BITN                                          16
#define GPT_RIS_WURIS_M                                             0x00010000
#define GPT_RIS_WURIS_S                                             16

// Field: [13]    DMABRIS
//
// GPT Timer B DMA Done Raw Interrupt Status
//
// 0: Transfer has not completed
// 1: Transfer has completed
#define GPT_RIS_DMABRIS                                             0x00002000
#define GPT_RIS_DMABRIS_BITN                                        13
#define GPT_RIS_DMABRIS_M                                           0x00002000
#define GPT_RIS_DMABRIS_S                                           13

// Field: [11]    TBMRIS
//
// GPT Timer B Match Raw  Interrupt
//
// 0:  The match value has not been reached
// 1:  The match value is reached.
//
// TBMR.TBMIE is set, and the match values in TBMATCHR and optionally
// TBPMR have been reached when configured in one-shot or periodic mode.
#define GPT_RIS_TBMRIS                                              0x00000800
#define GPT_RIS_TBMRIS_BITN                                         11
#define GPT_RIS_TBMRIS_M                                            0x00000800
#define GPT_RIS_TBMRIS_S                                            11

// Field: [10]    CBERIS
//
// GPT Timer B Capture Mode Event Raw Interrupt
//
// 0:  The event has not occured.
// 1:  The event has occured.
//
// This interrupt asserts when the subtimer is configured in Input Edge-Time
// mode
#define GPT_RIS_CBERIS                                              0x00000400
#define GPT_RIS_CBERIS_BITN                                         10
#define GPT_RIS_CBERIS_M                                            0x00000400
#define GPT_RIS_CBERIS_S                                            10

// Field: [9]    CBMRIS
//
// GPT Timer B Capture Mode Match Raw Interrupt
//
// 0:  Match for Timer B has not occured
// 1:  Match for Timer B has occurred.
//
// This interrupt asserts when the values in the TBR and TBPR match
// values in the TBMATCHR and TBPMR, and when configured in Input Edge-Time
// mode (reg-ref instead!!)
#define GPT_RIS_CBMRIS                                              0x00000200
#define GPT_RIS_CBMRIS_BITN                                         9
#define GPT_RIS_CBMRIS_M                                            0x00000200
#define GPT_RIS_CBMRIS_S                                            9

// Field: [8]    TBTORIS
//
// GPT Timer B Time-out Raw Interrupt
//
// 0:  Timer B has not timed out
// 1:  Timer B has timed out.
//
// This interrupt is asserted when a one-shot or periodic mode timer reaches
// it's count limit. The count limit is 0 or the value loaded into TBILR,
// depending on the count direction.
#define GPT_RIS_TBTORIS                                             0x00000100
#define GPT_RIS_TBTORIS_BITN                                        8
#define GPT_RIS_TBTORIS_M                                           0x00000100
#define GPT_RIS_TBTORIS_S                                           8

// Field: [5]    DMAARIS
//
// GPT Timer A DMA Done Raw Interrupt Status
//
// 0: Transfer has not completed
// 1: Transfer has completed
#define GPT_RIS_DMAARIS                                             0x00000020
#define GPT_RIS_DMAARIS_BITN                                        5
#define GPT_RIS_DMAARIS_M                                           0x00000020
#define GPT_RIS_DMAARIS_S                                           5

// Field: [4]    TAMRIS
//
// GPT Timer A Match Raw  Interrupt
//
// 0:  The match value has not been reached
// 1:  The match value is reached.
//
// TAMR.TAMIE is set, and the match values in TAMATCHR and optionally
// TAPMR have been reached when configured in one-shot or periodic mode.
#define GPT_RIS_TAMRIS                                              0x00000010
#define GPT_RIS_TAMRIS_BITN                                         4
#define GPT_RIS_TAMRIS_M                                            0x00000010
#define GPT_RIS_TAMRIS_S                                            4

// Field: [3]    RTCRIS
//
// GPT RTC Raw Interrupt
//
// 0:  The RTC event has not occured
// 1:  The RTC event has occured
#define GPT_RIS_RTCRIS                                              0x00000008
#define GPT_RIS_RTCRIS_BITN                                         3
#define GPT_RIS_RTCRIS_M                                            0x00000008
#define GPT_RIS_RTCRIS_S                                            3

// Field: [2]    CAERIS
//
// GPT Timer A Capture Mode Event Raw Interrupt
//
// 0:  The event has not occured.
// 1:  The event has occured.
//
// This interrupt asserts when the subtimer is configured in Input Edge-Time
// mode
#define GPT_RIS_CAERIS                                              0x00000004
#define GPT_RIS_CAERIS_BITN                                         2
#define GPT_RIS_CAERIS_M                                            0x00000004
#define GPT_RIS_CAERIS_S                                            2

// Field: [1]    CAMRIS
//
// GPT Timer A Capture Mode Match Raw Interrupt
//
// 0:  Match for Timer A has not occured
// 1:  Match for Timer A has occurred
//
// This interrupt asserts when the values in the TAR and TAPR match
// values in the TAMATCHR and TAPMR, and when configured in Input Edge-Time
// mode (reg-ref instead!!)
#define GPT_RIS_CAMRIS                                              0x00000002
#define GPT_RIS_CAMRIS_BITN                                         1
#define GPT_RIS_CAMRIS_M                                            0x00000002
#define GPT_RIS_CAMRIS_S                                            1

