contiki-os/contiki/cc26xxware/inc/hw_gpt.h
// Field: [13]    DMABINT
//
// 0: Do nothing.
// 1: Clear RIS.DMABRIS and MIS.DMABMIS
#define GPT_ICLR_DMABINT                                            0x00002000
#define GPT_ICLR_DMABINT_BITN                                       13
#define GPT_ICLR_DMABINT_M                                          0x00002000
#define GPT_ICLR_DMABINT_S                                          13

// Field: [11]    TBMCINT
//
// 0: Do nothing.
// 1: Clear RIS.TBMRIS and MIS.TBMMIS
#define GPT_ICLR_TBMCINT                                            0x00000800
#define GPT_ICLR_TBMCINT_BITN                                       11
#define GPT_ICLR_TBMCINT_M                                          0x00000800
#define GPT_ICLR_TBMCINT_S                                          11

// Field: [10]    CBECINT
//
// 0: Do nothing.
// 1: Clear RIS.CBERIS and MIS.CBEMIS
#define GPT_ICLR_CBECINT                                            0x00000400
#define GPT_ICLR_CBECINT_BITN                                       10
#define GPT_ICLR_CBECINT_M                                          0x00000400
#define GPT_ICLR_CBECINT_S                                          10

// Field: [9]    CBMCINT
//
// 0: Do nothing.
// 1: Clear RIS.CBMRIS and MIS.CBMMIS
#define GPT_ICLR_CBMCINT                                            0x00000200
#define GPT_ICLR_CBMCINT_BITN                                       9
#define GPT_ICLR_CBMCINT_M                                          0x00000200
#define GPT_ICLR_CBMCINT_S                                          9

// Field: [8]    TBTOCINT
//
// 0: Do nothing.
// 1: Clear RIS.TBTORIS and MIS.TBTOMIS
#define GPT_ICLR_TBTOCINT                                           0x00000100
#define GPT_ICLR_TBTOCINT_BITN                                      8
#define GPT_ICLR_TBTOCINT_M                                         0x00000100
#define GPT_ICLR_TBTOCINT_S                                         8

// Field: [5]    DMAAINT
//
// 0: Do nothing.
// 1: Clear RIS.DMAARIS and MIS.DMAAMIS
#define GPT_ICLR_DMAAINT                                            0x00000020
#define GPT_ICLR_DMAAINT_BITN                                       5
#define GPT_ICLR_DMAAINT_M                                          0x00000020
#define GPT_ICLR_DMAAINT_S                                          5

// Field: [4]    TAMCINT
//
// 0: Do nothing.
// 1: Clear RIS.TAMRIS and MIS.TAMMIS
#define GPT_ICLR_TAMCINT                                            0x00000010
#define GPT_ICLR_TAMCINT_BITN                                       4
#define GPT_ICLR_TAMCINT_M                                          0x00000010
#define GPT_ICLR_TAMCINT_S                                          4

// Field: [3]    RTCCINT
//
// 0: Do nothing.
// 1: Clear RIS.RTCRIS and MIS.RTCMIS
#define GPT_ICLR_RTCCINT                                            0x00000008
#define GPT_ICLR_RTCCINT_BITN                                       3
#define GPT_ICLR_RTCCINT_M                                          0x00000008
#define GPT_ICLR_RTCCINT_S                                          3

// Field: [2]    CAECINT
//
// 0: Do nothing.
// 1: Clear RIS.CAERIS and MIS.CAEMIS
#define GPT_ICLR_CAECINT                                            0x00000004
#define GPT_ICLR_CAECINT_BITN                                       2
#define GPT_ICLR_CAECINT_M                                          0x00000004
#define GPT_ICLR_CAECINT_S                                          2

// Field: [1]    CAMCINT
//
// 0: Do nothing.
// 1: Clear RIS.CAMRIS and MIS.CAMMIS
#define GPT_ICLR_CAMCINT                                            0x00000002
#define GPT_ICLR_CAMCINT_BITN                                       1
#define GPT_ICLR_CAMCINT_M                                          0x00000002
#define GPT_ICLR_CAMCINT_S                                          1

// Field: [0]    TATOCINT
//
// 0: Do nothing.
// 1: Clear RIS.TATORIS and MIS.TATOMIS
#define GPT_ICLR_TATOCINT                                           0x00000001
#define GPT_ICLR_TATOCINT_BITN                                      0
#define GPT_ICLR_TATOCINT_M                                         0x00000001
#define GPT_ICLR_TATOCINT_S                                         0

//*****************************************************************************
//
// Register: GPT_O_TAILR
//
//*****************************************************************************
// Field: [31:0] TAILR
//
// GPT Timer A Interval Load  Register
#define GPT_TAILR_TAILR_M                                           0xFFFFFFFF
#define GPT_TAILR_TAILR_S                                           0

//*****************************************************************************
//
// Register: GPT_O_TBILR
//
//*****************************************************************************
// Field: [31:0] TBILR
//
// GPT Timer B Interval Load  Register
#define GPT_TBILR_TBILR_M                                           0xFFFFFFFF
#define GPT_TBILR_TBILR_S                                           0

//*****************************************************************************
//
// Register: GPT_O_TAMATCHR
//
//*****************************************************************************
// Field: [31:0] TAMATCHR
//
// GPT Timer A Match Register
#define GPT_TAMATCHR_TAMATCHR_M                                     0xFFFFFFFF
#define GPT_TAMATCHR_TAMATCHR_S                                     0

//*****************************************************************************
//
// Register: GPT_O_TBMATCHR
//
//*****************************************************************************
// Field: [31:0] TBMATCHR
//
// GPT Timer B Match Register
#define GPT_TBMATCHR_TBMATCHR_M                                     0xFFFFFFFF
#define GPT_TBMATCHR_TBMATCHR_S                                     0

//*****************************************************************************
//
// Register: GPT_O_TAPR
//
//*****************************************************************************
// Field: [7:0] TAPSR
//
// Timer A Pre-scale.
//
// Prescaler ratio in one-shot and periodic count mode is TAPSR + 1, ie:
//
// 0: Prescaler ratio = 1
// 1: Prescaler ratio = 2
// 2: Prescaler ratio = 3
// ...
// 255: Prescaler ratio = 256
#define GPT_TAPR_TAPSR_M                                            0x000000FF
#define GPT_TAPR_TAPSR_S                                            0

//*****************************************************************************
//
// Register: GPT_O_TBPR
//
//*****************************************************************************
// Field: [7:0] TBPSR
//
// Timer B Pre-scale.
//
// Prescale ratio in one-shot and periodic count mode is TBPSR + 1, ie:
//
//
// 0: Prescaler ratio = 1
// 1: Prescaler ratio = 2
// 2: Prescaler ratio = 3
// ...
// 255: Prescaler ratio = 256
#define GPT_TBPR_TBPSR_M                                            0x000000FF
#define GPT_TBPR_TBPSR_S                                            0

//*****************************************************************************
//
// Register: GPT_O_TAPMR
//
//*****************************************************************************
// Field: [7:0] TAPSMR
//
// GPT Timer A Pre-scale Match.  In 16 bit mode this field holds bits 23 to 16.
#define GPT_TAPMR_TAPSMR_M                                          0x000000FF
#define GPT_TAPMR_TAPSMR_S                                          0

//*****************************************************************************
//
// Register: GPT_O_TBPMR
//
//*****************************************************************************
// Field: [7:0] TBPSMR
//
// GPT Timer B Pre-scale Match Register.  In 16 bit mode this field holds bits 23
// to 16.
#define GPT_TBPMR_TBPSMR_M                                          0x000000FF
#define GPT_TBPMR_TBPSMR_S                                          0

//*****************************************************************************
//
// Register: GPT_O_TAR
//
//*****************************************************************************
// Field: [31:0] TAR
//
// GPT Timer A Register
//
// A read returns the current value of the Timer A Count Register, in all cases
// except for Input Edge count and Timer modes.
// In the Input Edge Count Mode, this register contains the number of edges that
// have occurred. In the Input Edge Time mode, this register contains the time at
// which the last edge event took place.
#define GPT_TAR_TAR_M                                               0xFFFFFFFF
#define GPT_TAR_TAR_S                                               0

//*****************************************************************************
//
// Register: GPT_O_TBR
//
//*****************************************************************************
// Field: [31:0] TBR
//
// GPT Timer B Register
//
// A read returns the current value of the Timer B Count Register, in all cases
// except for Input Edge count and Timer modes.
// In the Input Edge Count Mode, this register contains the number of edges that
// have occurred. In the Input Edge Time mode, this register contains the time at
// which the last edge event took place.
#define GPT_TBR_TBR_M                                               0xFFFFFFFF
#define GPT_TBR_TBR_S                                               0

//*****************************************************************************
//
// Register: GPT_O_TAV
//
//*****************************************************************************
// Field: [31:0] TAV
//
// GPT Timer A Register
#define GPT_TAV_TAV_M                                               0xFFFFFFFF
#define GPT_TAV_TAV_S                                               0

//*****************************************************************************
//
// Register: GPT_O_TBV
//
//*****************************************************************************
// Field: [31:0] TBV
//
// GPT Timer B Register
#define GPT_TBV_TBV_M                                               0xFFFFFFFF
#define GPT_TBV_TBV_S                                               0

//*****************************************************************************
//
// Register: GPT_O_RTCPD
//
//*****************************************************************************
// Field: [15:0] RTCPD
//
// GPT RTC Pre-divider
#define GPT_RTCPD_RTCPD_M                                           0x0000FFFF
#define GPT_RTCPD_RTCPD_S                                           0

//*****************************************************************************
//
// Register: GPT_O_TAPS
//
//*****************************************************************************
// Field: [15:0] PSS
//
// GPT Timer A Pre-scaler
#define GPT_TAPS_PSS_M                                              0x0000FFFF
#define GPT_TAPS_PSS_S                                              0

//*****************************************************************************
//
// Register: GPT_O_TBPS
//
//*****************************************************************************
// Field: [15:0] PSS
//
// GPT Timer B Pre-scaler
#define GPT_TBPS_PSS_M                                              0x0000FFFF
#define GPT_TBPS_PSS_S                                              0

//*****************************************************************************
//
// Register: GPT_O_TAPV
//
//*****************************************************************************
// Field: [15:0] PSV
//
// GPT Timer A Pre-scaler Value
#define GPT_TAPV_PSV_M                                              0x0000FFFF
#define GPT_TAPV_PSV_S                                              0

//*****************************************************************************
//
// Register: GPT_O_TBPV
//
//*****************************************************************************
// Field: [15:0] PSV
//
// GPT Timer B Pre-scaler Value
#define GPT_TBPV_PSV_M                                              0x0000FFFF
#define GPT_TBPV_PSV_S                                              0

//*****************************************************************************
//
// Register: GPT_O_DMAEV
//
//*****************************************************************************
// Field: [11]    TBMDMAEN
//
// GPT Timer B Match DMA Trigger Enable
#define GPT_DMAEV_TBMDMAEN                                          0x00000800
#define GPT_DMAEV_TBMDMAEN_BITN                                     11
#define GPT_DMAEV_TBMDMAEN_M                                        0x00000800
#define GPT_DMAEV_TBMDMAEN_S                                        11

